# include <iostream>
# include <vector>

int main()
{
	std::vector <int> personal {1,1,1,1,1,1,1,1,1,1,1,1} ;    //персоны
	int device[4][12]        { {1,1,1,1,1,1,1,1,1,1,1,1},     //Ложка
						       {1,1,1,1,1,1,1,1,1,1,1,1},     //Вилка
		                       {1,1,1,1,1,1,1,1,1,1,1,1},     //Нож
						       {0,0,0,0,0,1,1,0,0,0,0,0} };   //Десертная ложка

	int dish [3][12]         { {1,1,1,1,1,1,1,1,1,1,1,1},     //Тарелка для первого блюда
						       {1,1,1,1,1,1,1,1,1,1,1,1},     //Тарелка для второго блюда
	                           {0,0,0,0,0,1,1,0,0,0,0,0} };   //Десертная тарелка

    std::vector <int> chair    {1,1,1,1,1,1,1,1,1,1,1,1};     //стулья

//Дама привела ребёнка (+1 персона)
	personal.push_back(1);

//Дама привела ребёнка (+1 стул)
	chair.push_back(1);

//Кража ложки
	device[0][2] = 0;

//VIP персона поделилась ложкой (обычной)
	device[0][5] = 0;
	device[0][2] = 1;

//У VIP забрали десертную тарелку за ненадобностью
	dish[2][5] = 0;

//Результат. 1-присутствует, 0- отсутствует.

//Итого персонал (кол-во людей (был добавлен, в связи с появление ребенка))
	std::cout << "Personal: \n";

	for (int i = 0; i < personal.size(); i++) {
		std::cout << personal[i] << " ";
	}
	std::cout << "\n";

//Итого стульев (кол-во стульев (был добавлен, в связи с появление ребенка))
	std::cout << "Chair:  \n";

	for (int i = 0; i < chair.size(); i++) {
		std::cout << chair[i] << " ";
	}
	std::cout << "\n";

//Итого ложек, вилок и ножей.
	std::cout << "Device: \n";

	for (int i = 0; i < 4; i++) {
		for (int j = 0; j < 12; j++) {
			std::cout << device[i][j] << " ";
		}
		std::cout << "\n";
	}

//Итого тарелок (для первого, второго и десерта)
	std::cout << "Dish: \n";
	for (int i = 0; i < 3; i++) {
		for (int j = 0; j < 12; j++) {
			std::cout << dish[i][j]<<" ";
		}
		std::cout << "\n";
	}
}